In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
#df=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]],index=['A','B','C','D'],columns=['A1','B1','C1','D1'])
df=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]],columns=['A1','B1','C1','D1'])
print(df)

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [4]:
print(df.head(3)) #top 3
print(" ")
print(df.tail(3)) #bottom 3

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

   A1  B1  C1  D1
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [5]:
df.shape

(4, 4)

In [6]:
df.iloc[0::2,1:3]#start:stop+1:step 1st arg row 2nd arg colum
# .loc accessing with column names

   B1  C1
0   2   3
2  10  11

In [7]:
# dataframe using dictionary
dic={'Students':['Tanu','Anusha','Tanya','Ananaya','Harshita'],'Marks':[99.4,98.3,97.5,96.2,95.6],'Sport':['Badminton','Football','Cricket','Tennis','Hockey']}
df1=pd.DataFrame(dic,index=[1,2,3,4,5])
print(df1)

   Students  Marks      Sport
1      Tanu   99.4  Badminton
2    Anusha   98.3   Football
3     Tanya   97.5    Cricket
4   Ananaya   96.2     Tennis
5  Harshita   95.6     Hockey

In [8]:
# dataframe using 2D dictionary
Yr2015={'Q1':20000,'Q2':40000,'Q3':35000,'Q4':55000}
Yr2016={'Q1':25000,'Q2':46000,'Q3':36000,'Q4':50000}
Yr2017={'Q1':26000,'Q2':45000,'Q3':37000,'Q4':50500}
Yr2018={'Q1':27000,'Q2':48000,'Q3':34000,'Q4':56000}
diSales={2015:Yr2015,2016:Yr2016,2017:Yr2017,2018:Yr2018}
df1=pd.DataFrame(diSales)
print(df1)

     2015   2016   2017   2018
Q1  20000  25000  26000  27000
Q2  40000  46000  45000  48000
Q3  35000  36000  37000  34000
Q4  55000  50000  50500  56000

In [9]:
print(df1.count())
print(df1.count(1))

2015    4
2016    4
2017    4
2018    4
dtype: int64
Q1    4
Q2    4
Q3    4
Q4    4
dtype: int64

In [10]:
# transpose dataframe
df2=df1.T
print(df2)

         Q1     Q2     Q3     Q4
2015  20000  40000  35000  55000
2016  25000  46000  36000  50000
2017  26000  45000  37000  50500
2018  27000  48000  34000  56000

In [11]:
# Accessing column
# df2.Q1 or 
df2['Q1']

2015    20000
2016    25000
2017    26000
2018    27000
Name: Q1, dtype: int64

In [12]:
# Accessing multiple columns
df2[['Q1','Q2','Q3']]

         Q1     Q2     Q3
2015  20000  40000  35000
2016  25000  46000  36000
2017  26000  45000  37000
2018  27000  48000  34000

In [13]:
df1[2019]=[30000,34000,35000,38000]

In [14]:
df1

     2015   2016   2017   2018   2019
Q1  20000  25000  26000  27000  30000
Q2  40000  46000  45000  48000  34000
Q3  35000  36000  37000  34000  35000
Q4  55000  50000  50500  56000  38000

In [15]:
# merging dataframes
df2 = pd.DataFrame([[1,2,3],[5,7,7],[5,3,7]],
columns=['A','B','C'])

In [19]:
df3 = pd.DataFrame([[11,7,31],[5,2,7],[13,3,33]],
columns=['A1','B1','C1'])

In [20]:

df4=pd.merge(df2,df3,right_on='B1',left_on='B')#common values matching

In [21]:
df4

   A  B  C  A1  B1  C1
0  1  2  3   5   2   7
1  5  7  7  11   7  31
2  5  3  7  13   3  33